#สั่ง Run โปรแกรมข้างล่างนี้ แล้วทำความเข้าใจผลลัพธ์ที่แสดง

print("5 / 2 =", 5/2)
print("5 // 2 =", 5//2)

print("4**2 =", 4**2)
print("4**0.5 =", 4**0.5)

print("9 % 24 =", 9%24)
print("(9+24) % 24 =", (9+24)%24)

print("(-1+24) % 24 =", (-1+24)%24)
print("-1 % 24 =", -1%24)

print("4.5 % 1 =", 4.5%1)

print("int(4.9) =", int(4.9))
print("int(-4.9) =", int(-4.9))

#ผลลัพธ์
5 / 2 = 2.5
5 // 2 = 2
4**2 = 16
4**0.5 = 2.0
9 % 24 = 9
(9+24) % 24 = 9
(-1+24) % 24 = 23
-1 % 24 = 23
4.5 % 1 = 0.5
int(4.9) = 4
int(-4.9) = -4